[
  "El modelo relacional fue propuesto por Edgar F. Codd en 1970, y el primer sistema basado en él, System R, fue desarrollado por IBM a partir de 1974.",
  "SQL significa Structured Query Language y fue estandarizado por ANSI en 1986.",
  "Oracle fue una de las primeras bases de datos comerciales en implementar SQL.",
  "PostgreSQL tiene su origen en el proyecto POSTGRES, creado en la Universidad de California en Berkeley por Michael Stonebraker.",
  "Los índices en una base de datos aceleran las búsquedas, pero pueden hacer más lentas las inserciones y actualizaciones.",
  "MongoDB almacena datos en formato BSON, una representación binaria similar a JSON.",
  "La normalización reduce la redundancia y mejora la integridad de datos en una base de datos relacional.",
  "El término 'Big Data' comenzó a popularizarse en los años 2000 debido al crecimiento masivo de datos generado por empresas como Google, Amazon y redes sociales.",
  "Cada día se envían más de 300 mil millones de correos electrónicos en el mundo.",
  "Se estima que gran parte de los datos actuales se ha generado en los últimos años, debido al crecimiento exponencial del contenido digital.",
  "El modelo relacional fue propuesto por Edgar F. Codd, un matemático británico que trabajaba en IBM.",
  "Los data lakes almacenan datos en bruto, mientras que los data warehouses almacenan datos estructurados y transformados.",
  "Los científicos de datos pasan gran parte de su tiempo limpiando y preparando datos, a menudo estimado en un 70%–80%.",
  "Python es uno de los lenguajes más populares en ciencia de datos gracias a su simplicidad y librerías como pandas, numpy y scikit-learn.",
  "Las bases de datos NoSQL no usan tablas tradicionales, sino estructuras como documentos, grafos o pares clave-valor.",
  "Facebook utiliza TAO, un sistema distribuido optimizado para consultas de grafos sociales a gran escala.",
  "Las bases de datos de grafos como Neo4j son ideales para representar redes sociales, rutas o relaciones complejas.",
  "El formato CSV (Comma Separated Values) existe desde los años 70 y continúa usándose ampliamente.",
  "El machine learning depende de grandes volúmenes de datos limpios y representativos.",
  "Google BigQuery puede procesar terabytes de datos en segundos gracias a su arquitectura distribuida y columnar.",
  "El primer disco duro, creado por IBM en 1956 como parte del sistema RAMAC, pesaba más de una tonelada y almacenaba alrededor de 5 MB.",
  "El concepto de 'data mining' surgió en los años 90 para describir la extracción de patrones útiles en grandes volúmenes de datos.",
  "Se estima que las empresas analizan menos del 20% de los datos que recolectan.",
  "Los sistemas OLTP se usan para operaciones transaccionales diarias, mientras que los OLAP se enfocan en análisis y reportes.",
  "Amazon Redshift y Snowflake son ejemplos de bases de datos en la nube optimizadas para análisis masivo.",
  "El formato Parquet comprime y organiza datos de manera eficiente para análisis en big data.",
  "Los data pipelines permiten mover y transformar datos automáticamente desde diferentes fuentes.",
  "Los algoritmos de recomendación de Netflix y Spotify se basan en el análisis de comportamiento del usuario.",
  "El término 'data scientist' fue popularizado en 2008 por D.J. Patil y Jeff Hammerbacher.",
  "En la era digital, los datos se consideran el 'nuevo petróleo', aunque su valor depende del análisis y procesamiento.",
  "Google procesa más de 3.5 mil millones de búsquedas al día gracias a su red de centros de datos distribuidos.",
  "El formato JSON se volvió un estándar de facto para el intercambio de datos web desde principios de los años 2000.",
  "El lenguaje R fue creado en 1993 y sigue siendo ampliamente usado en estadística e investigación.",
  "Apache Hadoop permitió procesar datos masivos de manera distribuida usando hardware convencional.",
  "El término 'ETL' significa Extract, Transform, Load, un proceso clave en integración de datos.",
  "Bases de datos modernas como CockroachDB o TiDB están diseñadas para resistir fallos de nodos completos.",
  "El concepto de 'data governance' se refiere a la gestión, calidad y seguridad de los datos de una organización.",
  "Los algoritmos de clustering como K-Means ayudan a descubrir grupos naturales dentro de los datos.",
  "El lenguaje SQL tiene casi 50 años y sigue siendo esencial en la mayoría de los sistemas de bases de datos.",
  "Las consultas SQL mal optimizadas pueden multiplicar el tiempo de ejecución de forma drástica.",
  "Los data warehouses modernos pueden escalar separando cómputo y almacenamiento.",
  "El formato Avro fue diseñado por Apache para la serialización eficiente de datos en entornos big data.",
  "Las bases de datos en memoria, como Redis, son extremadamente rápidas pero dependen de la RAM.",
  "Según estimaciones, cada persona genera en promedio más de 1.7 MB de datos por segundo.",
  "Los data catalogs ayudan a las empresas a documentar y encontrar sus conjuntos de datos.",
  "Los científicos de datos combinan estadística, programación y conocimiento del dominio.",
  "La privacidad de los datos es uno de los mayores desafíos del siglo XXI.",
  "El almacenamiento en la nube permite acceder a datos desde cualquier parte del mundo.",
  "SQL es un lenguaje declarativo: expresa qué datos se necesitan, no cómo obtenerlos.",
  "Microsoft SQL Server fue lanzado en 1989, originalmente desarrollado junto con Sybase.",
  "El estándar SQL ha evolucionado con versiones como SQL-92, SQL:1999, SQL:2003, SQL:2011 y SQL:2016.",
  "Un esquema en SQL agrupa objetos como tablas, vistas y procedimientos, facilitando su organización.",
  "MySQL fue creado en 1995 y es ampliamente usado en aplicaciones web.",
  "SQL se divide en sublenguajes: DDL, DML, DCL y TCL.",
  "La cláusula JOIN permite combinar datos de múltiples tablas.",
  "La cláusula GROUP BY agrupa datos y permite aplicar funciones agregadas como SUM, AVG o COUNT.",
  "Cada sistema de base de datos tiene su propio dialecto SQL, como T-SQL en SQL Server o PL/pgSQL en PostgreSQL.",
  "SQL sigue siendo esencial en el análisis de datos moderno e integra con herramientas como Spark, Hadoop y BigQuery."
]
