[
  "El primer sistema de base de datos relacional fue desarrollado por IBM en 1970.",
  "SQL significa Structured Query Language y fue estandarizado en 1986.",
  "Oracle fue una de las primeras bases de datos comerciales en usar SQL.",
  "PostgreSQL fue creado en la Universidad de California en Berkeley.",
  "Los índices en una base de datos aceleran las búsquedas, pero hacen más lentas las inserciones.",
  "MongoDB almacena datos en formato BSON, similar a JSON.",
  "La normalización evita la redundancia de datos en una base de datos relacional.",
  "El término 'Big Data' empezó a popularizarse en los años 2000 gracias a empresas como Google y Amazon.",
  "Cada día se generan más de 300 millones de correos electrónicos en el mundo.",
  "El 90% de los datos del mundo fueron creados en los últimos dos años.",
  "El modelo relacional fue propuesto por Edgar F. Codd, un matemático británico de IBM.",
  "Los data lakes almacenan datos en bruto, mientras que los data warehouses almacenan datos estructurados y procesados.",
  "Los científicos de datos pasan alrededor del 80% de su tiempo limpiando y preparando datos.",
  "Python es el lenguaje más popular en ciencia de datos gracias a su simplicidad y a librerías como pandas, numpy y scikit-learn.",
  "Las bases de datos NoSQL no usan tablas, sino estructuras como documentos, grafos o pares clave-valor.",
  "Facebook usa un sistema de almacenamiento distribuido llamado TAO para manejar billones de interacciones diarias.",
  "Los grafos de bases de datos como Neo4j son ideales para representar redes sociales o rutas.",
  "El formato CSV (Comma Separated Values) existe desde los años 70 y aún se usa ampliamente.",
  "El machine learning depende de grandes volúmenes de datos limpios y representativos.",
  "Google BigQuery puede procesar terabytes de datos en segundos gracias a su arquitectura distribuida.",
  "El primer disco duro creado por IBM en 1956 pesaba más de una tonelada y almacenaba solo 5 MB.",
  "El concepto de 'data mining' surgió en los años 90 para describir la extracción de patrones útiles en grandes volúmenes de datos.",
  "En promedio, las empresas solo analizan alrededor del 12% de los datos que recolectan.",
  "Los sistemas OLTP (Online Transaction Processing) se usan para operaciones diarias, mientras que los OLAP son para análisis y reportes.",
  "Amazon Redshift y Snowflake son ejemplos de bases de datos en la nube optimizadas para análisis masivo.",
  "El formato Parquet comprime los datos de manera eficiente para análisis en big data.",
  "Los data pipelines permiten mover y transformar datos automáticamente desde diferentes fuentes.",
  "Los algoritmos de recomendación de Netflix y Spotify se basan en el análisis de datos de comportamiento del usuario.",
  "El término 'data scientist' fue acuñado en 2008 por D.J. Patil y Jeff Hammerbacher.",
  "En la era digital, los datos se consideran el 'nuevo petróleo', aunque su valor depende de su procesamiento.",
  "Los servidores de Google están distribuidos por todo el mundo y procesan más de 3.5 mil millones de búsquedas diarias.",
  "El formato JSON (JavaScript Object Notation) se volvió estándar para intercambio de datos web desde 2001.",
  "El lenguaje R fue creado en 1993 para análisis estadístico y sigue siendo muy usado en investigación.",
  "Apache Hadoop permitió procesar datos masivos de manera distribuida usando hardware común.",
  "El término 'ETL' significa Extract, Transform, Load, un proceso clave en la integración de datos.",
  "Las bases de datos modernas como CockroachDB o TiDB están diseñadas para resistir fallos de servidores completos.",
  "El concepto de 'data governance' se refiere al control y calidad de los datos en una organización.",
  "Los algoritmos de clustering como K-Means ayudan a descubrir grupos naturales dentro de los datos.",
  "El lenguaje SQL tiene más de 50 años y sigue siendo esencial en casi todos los sistemas de bases de datos.",
  "Las consultas SQL mal optimizadas pueden multiplicar el tiempo de ejecución por miles.",
  "Los data warehouses modernos pueden separar el cómputo del almacenamiento para escalar mejor.",
  "El formato Avro fue diseñado por Apache para la serialización eficiente de datos en pipelines.",
  "Las bases de datos en memoria, como Redis, son extremadamente rápidas pero dependen de la RAM.",
  "Cada segundo, se generan más de 1.7 MB de datos por persona en promedio en el mundo.",
  "Los 'data catalogs' ayudan a las empresas a encontrar y documentar sus conjuntos de datos internos.",
  "Los científicos de datos combinan estadística, programación y conocimiento del dominio del problema.",
  "La privacidad de los datos es uno de los mayores desafíos del siglo XXI.",
  "El almacenamiento en la nube ha hecho posible el acceso a datos desde cualquier parte del mundo."
]
